
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>分布式概述 · 分布式-软件架构</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-multipart/multipart.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-toggle-chapters/toggle.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-okaidia.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="website.css">
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="pages/mq.html" />
    
    

    
        <link rel="shortcut icon" href='assets/images/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='assets/images/favicon.ico' type="image/x-icon">
    
    
        <link rel="apple-touch-icon" href='assets/images/apple-touch-icon.png'>
    
    
        
        <link rel="apple-touch-icon" sizes="120x120" href="assets/images/apple-touch-icon-120x120.png">
        
        <link rel="apple-touch-icon" sizes="180x180" href="assets/images/apple-touch-icon-180x180.png">
        
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" >
            
                <a target="_blank" href="http://colin-chang.site/about/">
            
                    
                    About Me
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <a target="_blank" href="http://colin-chang.site">
            
                    
                    Colin's Blog
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    分布式概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="pages/mq.html">
            
                <a href="pages/mq.html">
            
                    
                    1 消息队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="pages/exceptionless.html">
            
                <a href="pages/exceptionless.html">
            
                    
                    2 分布式异常日志框架
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >分布式概述</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;"><a name="&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;" class="plugin-anchor" href="#&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;</h1>
<p>&#x5173;&#x4E8E;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x5728;&#x7F51;&#x4E0A;&#x5B58;&#x5728;&#x7740;&#x5927;&#x91CF;&#x7684;&#x76F8;&#x5173;&#x8D44;&#x6599;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6280;&#x672F;&#x6808;&#x4E2D;&#x53C8;&#x5B58;&#x5728;&#x8FD9;&#x4E9B;&#x8BB8;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x4F46;&#x7A76;&#x5176;&#x6839;&#x672C;&#x6574;&#x4F53;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x5927;&#x540C;&#x5C0F;&#x5F02;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5C31;&#x6B64;&#x4EE5;.net&#x5E73;&#x53F0;&#x4E3A;&#x4F8B;&#xFF0C;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x7684;&#x6F14;&#x5316;&#x8FC7;&#x7A0B;&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x68B3;&#x7406;&#x3002;</p>
<p>&#x9996;&#x5148;&#x8BF4;&#x660E;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x662F;&#x57FA;&#x4E8E;&#x666E;&#x904D;&#x5316;&#x7684;&#x901A;&#x7528;&#x7CFB;&#x7EDF;&#x800C;&#x4E0D;&#x662F;&#x505A;&#x5E76;&#x884C;&#x6570;&#x636E;&#x5E93;&#x7B49;&#x57FA;&#x7840;&#x670D;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#x5728;Hadoop&#x3001;Spark&#x3001;ZooKeeper&#x3001;dubbo&#x7B49;&#x6211;&#x4EEC;&#x6682;&#x4E0D;&#x8003;&#x8651;&#x3002;</p>
<h3 id="1-&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;"><a name="1-&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;" class="plugin-anchor" href="#1-&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;"><i class="fa fa-link" aria-hidden="true"></i></a>1. &#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;</h3>
<p>&#x6700;&#x521D;&#x5047;&#x8BBE;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x3001;&#x6587;&#x4EF6;&#x548C;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x653E;&#x5728;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x5305;&#x6253;&#x5929;&#x4E0B;&#x3002;
<img src="img/distribution1.png" alt="&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;"></p>
<h3 id="2-&#x4E0D;&#x540C;&#x670D;&#x52A1;&#x5668;"><a name="2-&#x4E0D;&#x540C;&#x670D;&#x52A1;&#x5668;" class="plugin-anchor" href="#2-&#x4E0D;&#x540C;&#x670D;&#x52A1;&#x5668;"><i class="fa fa-link" aria-hidden="true"></i></a>2. &#x4E0D;&#x540C;&#x670D;&#x52A1;&#x5668;</h3>
<p>&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x6269;&#x5C55;&#xFF0C;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x6027;&#x80FD;&#x9700;&#x6C42;&#xFF0C;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x5C06;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x3001;&#x6570;&#x636E;&#x5E93;&#x3001;&#x6587;&#x4EF6;&#x5206;&#x522B;&#x90E8;&#x7F72;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x670D;&#x52A1;&#x5668;&#x7528;&#x9014;&#x4E0D;&#x540C;&#xFF0C;&#x914D;&#x7F6E;&#x4E0D;&#x540C;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x8FBE;&#x5230;&#x6027;&#x80FD;&#x6700;&#x4F73;&#x7684;&#x6548;&#x679C;&#x3002;
<img src="img/distribution2.png" alt="&#x5206;&#x4E0D;&#x540C;&#x670D;&#x52A1;&#x5668;"></p>
<h3 id="3-&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;"><a name="3-&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;" class="plugin-anchor" href="#3-&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;"><i class="fa fa-link" aria-hidden="true"></i></a>3. &#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;</h3>
<p>&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x6269;&#x5C55;&#xFF0C;&#x4E00;&#x53F0;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x3001;&#x6570;&#x636E;&#x5E93;&#x3001;&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x6027;&#x80FD;&#x65E0;&#x6CD5;&#x627F;&#x8F7D;&#x5927;&#x91CF;&#x6570;&#x636E;&#x5904;&#x7406;&#x3001;&#x9AD8;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x91C7;&#x7528;&#x96C6;&#x7FA4;&#x65B9;&#x5F0F;&#x3002;</p>
<h4 id="31-&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;"><a name="31-&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;" class="plugin-anchor" href="#31-&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;"><i class="fa fa-link" aria-hidden="true"></i></a>3.1 &#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;+&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;</h4>
<ul>
<li>&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#x5668;&#x4F5C;&#x4E3A;&#x7F51;&#x7AD9;&#x7684;&#x5165;&#x53E3;&#xFF0C;&#x4F1A;&#x627F;&#x62C5;&#x5927;&#x91CF;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x6765;&#x5206;&#x62C5;&#x8BF7;&#x6C42;&#x6570;&#x3002;</li>
<li>&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x524D;&#x9762;&#x9700;&#x8981;&#x90E8;&#x7F72;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x670D;&#x52A1;&#x5668;&#x8C03;&#x5EA6;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#xFF0C;&#x6839;&#x636E;&#x5206;&#x53D1;&#x7B56;&#x7565;&#x5C06;&#x8BF7;&#x6C42;&#x5206;&#x53D1;&#x5230;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x8282;&#x70B9;&#x3002;&#x4EE5;&#x4E0B;&#x4E3A;&#x5E38;&#x7528;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x6280;&#x672F;<ul>
<li>&#x786C;&#x4EF6;&#x7684;&#x6709;F5&#xFF0C;&#x4EF7;&#x683C;&#x6BD4;&#x8F83;&#x8D35;&#xFF0C;</li>
<li>&#x8F6F;&#x4EF6;&#x7684;&#x6709;LVS&#x3001;Nginx&#x3001;HAProxy&#x7B49;&#x3002;</li>
</ul>
</li>
</ul>
<h4 id="32-&#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#x548C;&#x4F18;&#x5316;"><a name="32-&#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#x548C;&#x4F18;&#x5316;" class="plugin-anchor" href="#32-&#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#x548C;&#x4F18;&#x5316;"><i class="fa fa-link" aria-hidden="true"></i></a>3.2 &#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#x548C;&#x4F18;&#x5316;</h4>
<p>&#x968F;&#x7740;&#x7528;&#x6237;&#x91CF;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x6210;&#x4E3A;&#x6700;&#x5927;&#x7684;&#x74F6;&#x9888;&#xFF0C;&#x6539;&#x5584;&#x6570;&#x636E;&#x5E93;&#x6027;&#x80FD;&#x5E38;&#x7528;&#x7684;&#x624B;&#x6BB5;&#x662F;&#x8FDB;&#x884C;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x4EE5;&#x53CA;&#x5206;&#x8868;&#xFF0C;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x987E;&#x540D;&#x601D;&#x4E49;&#x5C31;&#x662F;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x5206;&#x4E3A;&#x8BFB;&#x5E93;&#x548C;&#x5199;&#x5E93;&#xFF0C;&#x901A;&#x8FC7;&#x4E3B;&#x5907;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x540C;&#x6B65;&#x3002;&#x5206;&#x5E93;&#x5206;&#x8868;&#x5219;&#x5206;&#x4E3A;&#x6C34;&#x5E73;&#x5207;&#x5206;&#x548C;&#x5782;&#x76F4;&#x5207;&#x5206;&#xFF0C;&#x6C34;&#x5E73;&#x5207;&#x6362;&#x5219;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7279;&#x5927;&#x7684;&#x8868;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#xFF0C;&#x4F8B;&#x5982;&#x8BA2;&#x5355;&#x3001;&#x7269;&#x6D41;&#x4FE1;&#x606F;&#x8868;&#x7B49;&#x3002;&#x5782;&#x76F4;&#x5207;&#x5206;&#x5219;&#x662F;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x4E0D;&#x540C;&#x6765;&#x5207;&#x6362;&#xFF0C;&#x5982;&#x8BA2;&#x5355;&#x3001;&#x8BA1;&#x7A0E;&#x7B49;&#x7B49;&#x4E0D;&#x540C;&#x7684;&#x4E3B;&#x9898;&#x653E;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5173;&#x8054;&#x67E5;&#x8BE2;&#x662F;&#x6CA1;&#x6709;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x7684;&#x53BB;&#x89E3;&#x51B3;&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x91C7;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#xFF0C;&#x6765;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x505A;&#x6CD5;&#xFF0C;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x6570;&#x636E;&#x8868;&#x62C6;&#x5206;&#x4E3A;&#x5F53;&#x524D;&#x64CD;&#x4F5C;&#x8868;&#x548C;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x8868;&#xFF0C; &#x5F53;&#x524D;&#x64CD;&#x4F5C;&#x8868;&#x53EA;&#x4FDD;&#x7559;&#x6B63;&#x5728;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5B8C;&#x6210;&#x540E;&#x8F6C;&#x5165;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x8868;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x5F53;&#x524D;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x7684;&#x6548;&#x7387;&#x3002;</p>
<h4 id="33-&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;"><a name="33-&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;" class="plugin-anchor" href="#33-&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;"><i class="fa fa-link" aria-hidden="true"></i></a>3.3 &#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;</h4>
<p>&#x7528;&#x6237;&#x4E00;&#x5929;&#x5929;&#x589E;&#x52A0;&#xFF0C;&#x4E1A;&#x52A1;&#x91CF;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x4EA7;&#x751F;&#x7684;&#x6587;&#x4EF6;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x6587;&#x4EF6;&#x5EFA;&#x8BAE;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;1&#x4E07;&#x4E2A;&#xFF0C;&#x5426;&#x5219;&#x5BF9;&#x4E8E;&#x6587;&#x4EF6;&#x7684;&#x67E5;&#x627E;&#x548C;&#x8F6E;&#x8BE2;&#x90FD;&#x4F1A;&#x975E;&#x5E38;&#x6162;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x662F;&#x6309;&#x7167;&quot;\&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x540D;\&#x6A21;&#x5757;&#x540D;&#x79F0;\&#x65E5;&#x671F;&quot;&#x7684;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x7EC4;&#x7EC7;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x6587;&#x4EF6;&#x6570;&#x76EE;&#x4ECD;&#x65E7;&#x5F88;&#x5927;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5E94;&#x8BE5;&#x518D;&#x7EC6;&#x5206;&#x3002;&#x5F53;&#x5355;&#x53F0;&#x7684;&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x5DF2;&#x7ECF;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x652F;&#x6491;&#x3002;&#x5E38;&#x7528;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6709;NFS&#x3002;&#x6211;&#x4EEC;&#x7528;&#x7684;&#x662F;MS&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF08;DFS&#xFF09;&#xFF0C;&#x4E0E;AD&#x57DF;&#x76F8;&#x5173;&#x6027;&#x8F83;&#x5927;&#x3002;</p>
<h4 id="34-&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;"><a name="34-&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;" class="plugin-anchor" href="#34-&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;"><i class="fa fa-link" aria-hidden="true"></i></a>3.4 &#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;</h4>
<p>&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x662F;&#x96C6;&#x7FA4;&#x65B9;&#x5F0F;&#xFF0C;&#x7528;&#x6237;&#x524D;&#x540E;&#x4E24;&#x6B21;&#x8BF7;&#x6C42;&#x53EF;&#x80FD;&#x8BBF;&#x95EE;&#x7684;&#x4E0D;&#x662F;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x3002;&#x56E0;&#x6B64;&#x5DF2;&#x7ECF;&#x4E0D;&#x80FD;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#x4F7F;&#x7528;&#x72B6;&#x6001;&#xFF08;Application&#x3001;Session&#x3001;Cache&#x3001;ViewState&#x7B49;&#xFF09;&#xFF0C;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x662F;&#x65E0;&#x72B6;&#x6001;&#x7684;&#xFF08;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x7528;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5177;&#x6709;&#x4F1A;&#x8BDD;&#x4FDD;&#x6301;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x53EA;&#x4F1A;&#x5B9A;&#x4F4D;&#x5230;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF09;&#x3002;&#x7CFB;&#x7EDF;&#x7684;&#x7F13;&#x5B58;&#x5E94;&#x8BE5;&#x4FDD;&#x5B58;&#x5728;&#x4E13;&#x95E8;&#x7684;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x5FC5;&#x987B;&#x6709;&#x72B6;&#x6001;&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x4FDD;&#x5B58;&#x5728;&#x4E13;&#x95E8;&#x7684;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x3002;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x6279;&#x5403;&#x8783;&#x87F9;&#x8005;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x4E86;&#x5FAE;&#x8F6F;&#x7684;AppFabric&#x4F5C;&#x4E3A;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x65F6;&#x7248;&#x672C;&#x5F88;&#x4F4E;&#xFF0C;&#x95EE;&#x9898;&#x4E5F;&#x4E0D;&#x5C11;&#xFF0C;&#x540E;&#x6765;&#x6211;&#x4EEC;&#x5F03;&#x7528;&#x4E86;AppFabric&#xFF0C;&#x4F7F;&#x7528;Redis&#x4F5C;&#x4E3A;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x3002;&#x73B0;&#x5728;&#xFF0C;AppFabric&#x5DF2;&#x7ECF;&#x6539;&#x8FDB;&#x4E86;&#x4E0D;&#x5C11;&#xFF0C;&#x8FD0;&#x884C;&#x5728;Azure&#x4E91;&#x4E0A;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x4E0D;&#x4F1A;&#x5B58;&#x5728;&#x4EE5;&#x524D;&#x7684;&#x95EE;&#x9898;&#x4E86;&#x3002;</p>
<p><img src="img/distribution3.png" alt="&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;"></p>
<p><em>&#x5BF9;&#x4E8E;&#x5404;&#x79CD;&#x653F;&#x5E9C;&#x3001;&#x5355;&#x4F4D;&#x7B49;&#x4E0D;&#x80FD;&#x5C06;&#x7CFB;&#x7EDF;&#x90E8;&#x7F72;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x90E8;&#x95E8;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5404;&#x7701;&#x3001;&#x5E02;&#x90FD;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x5206;&#x652F;&#x673A;&#x6784;&#x3002;&#x56E0;&#x4E3A;&#x7F51;&#x7EDC;&#x4E13;&#x7EBF;&#x7684;&#x4EF7;&#x683C;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#xFF0C;&#x81F3;&#x5C11;&#x6BD4;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x4F4E;&#x4E86;&#x4E0D;&#x5C11;&#xFF0C;&#x5F53;&#x7136;&#x4E86;&#x4E0D;&#x5DEE;&#x94B1;&#x7684;&#x4E0D;&#x8BF4;&#x554A;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x91C7;&#x7528;&#x5982;&#x4E0A;&#x7684;&#x96C6;&#x4E2D;&#x5F0F;&#x3001;&#x96C6;&#x7FA4;&#x90E8;&#x7F72;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x91C7;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7B2C;&#x4E00;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x662F;&#x5404;&#x5206;&#x652F;&#x673A;&#x6784;&#x642D;&#x5EFA;&#x4E00;&#x6574;&#x5957;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B9A;&#x671F;&#xFF08;&#x4F8B;&#x5982;&#x6BCF;&#x5929;&#xFF09;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x7684;&#x540C;&#x6B65;&#x5DE5;&#x4F5C;&#xFF0C;&#x5C06;&#x5206;&#x652F;&#x6570;&#x636E;&#x6C47;&#x603B;&#x5230;&#x603B;&#x90E8;&#x3001;&#x603B;&#x90E8;&#x7684;&#x6570;&#x636E;&#x4E0B;&#x53D1;&#x56DE;&#x5404;&#x5206;&#x90E8;&#xFF1B;&#x7B2C;&#x4E8C;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x65B9;&#x5F0F;&#x662F;&#x5404;&#x5206;&#x652F;&#x90E8;&#x7F72;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x5728;&#x603B;&#x90E8;&#x3002;</em></p>
<h3 id="4-&#x5E94;&#x7528;&#x6C34;&#x5E73;&#x62C6;&#x5206;&#x6D88;&#x606F;&#x961F;&#x5217;"><a name="4-&#x5E94;&#x7528;&#x6C34;&#x5E73;&#x62C6;&#x5206;&#x6D88;&#x606F;&#x961F;&#x5217;" class="plugin-anchor" href="#4-&#x5E94;&#x7528;&#x6C34;&#x5E73;&#x62C6;&#x5206;&#x6D88;&#x606F;&#x961F;&#x5217;"><i class="fa fa-link" aria-hidden="true"></i></a>4. &#x5E94;&#x7528;&#x6C34;&#x5E73;&#x62C6;&#x5206;+&#x6D88;&#x606F;&#x961F;&#x5217;</h3>
<p>&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x8FDB;&#x4E00;&#x6B65;&#x6269;&#x5C55;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x81C3;&#x80BF;&#xFF0C;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x4E1A;&#x52A1;&#x62C6;&#x5206;&#xFF0C;&#x5982;&#x6211;&#x4EEC;&#x505A;&#x7684;&#x7EFC;&#x5408;&#x4E1A;&#x52A1;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x5206;&#x4E3A;&#x95E8;&#x6237;&#x3001;&#x8054;&#x7CFB;&#x5904;&#x7F6E;&#x3001;&#x4E1A;&#x52A1;&#x4FE1;&#x606F;&#x3001;&#x6307;&#x6807;&#x3001;&#x6570;&#x636E;&#x67E5;&#x8BE2;&#x5206;&#x6790;&#x7B49;&#x4E1A;&#x52A1;&#x677F;&#x5757;&#x3002;&#x6BCF;&#x4E2A;&#x4E1A;&#x52A1;&#x677F;&#x5757;&#x662F;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x5E94;&#x7528;&#x8D1F;&#x8D23;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x7684;&#x4E1A;&#x52A1;&#x8FD0;&#x4F5C;&#x3002;&#x4E1A;&#x52A1;&#x677F;&#x5757;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x6D88;&#x606F;&#x961F;&#x5217;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x6570;&#x636E;&#x5E93;&#x4E5F;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x62C6;&#x5206;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x4E3B;&#x9898;&#x653E;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x6700;&#x597D;&#x642D;&#x5EFA;&#x9759;&#x6001;&#x8D44;&#x6E90;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5C06;&#x516C;&#x7528;&#x7684;css&#x3001;js&#x3001;images&#x7B49;&#x90FD;&#x5B58;&#x653E;&#x5230;&#x9759;&#x6001;&#x8D44;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x3002;
<img src="img/distribution4.png" alt="&#x5E94;&#x7528;&#x6C34;&#x5E73;&#x62C6;&#x5206;+&#x6D88;&#x606F;&#x961F;&#x5217;"></p>
<h3 id="5-nosql&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x670D;&#x52A1;"><a name="5-nosql&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x670D;&#x52A1;" class="plugin-anchor" href="#5-nosql&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x670D;&#x52A1;"><i class="fa fa-link" aria-hidden="true"></i></a>5. NoSQL+&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x670D;&#x52A1;</h3>
<p>&#x5BF9;&#x4E8E;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;nosql&#x6570;&#x636E;&#x5E93;&#x52A0;&#x4E0A;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x8981;&#x653E;&#x5728;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x4E2D;&#x3002;&#x5E38;&#x7528;&#x7684;NOSQL&#x6709;mongodb&#x548C;redis&#xFF0C;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6709;lucene&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;Solr&#x3001;ElasticSearch&#x7B49;&#x57FA;&#x4E8E;Lucene&#x5185;&#x6838;&#x5B9E;&#x73B0;&#x7684;&#x66F4;&#x6613;&#x7528;&#x7684;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x3002;&#x6570;&#x636E;&#x91CF;&#x5927;&#x7684;&#x8BDD;&#xFF0C;Solr&#x7B49;&#x4E5F;&#x8981;&#x505A;&#x6210;&#x96C6;&#x7FA4;&#x3002;
<img src="img/distribution5.png" alt="NoSQL+&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x670D;&#x52A1;"></p>
<p>&#x516D;&#x3001;&#x518D;&#x5F80;&#x4E0B;&#x8D70;&#xFF0C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x4E0E;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E5F;&#x8981;&#x7ED9;&#x5404;&#x79CD;&#x524D;&#x7AEF;&#xFF08;&#x4F8B;&#x5982;&#x7F51;&#x7AD9;&#x3001;&#x5B89;&#x5353;&#x3001;IOS&#xFF09;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x5728;&#x903B;&#x8F91;&#x5C42;&#x4E4B;&#x4E0A;&#x5EFA;&#x8BBE;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5C42;&#xFF0C;&#x63D0;&#x4F9B;&#x5BF9;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x548C;&#x5BF9;&#x5916;&#x7684;SOA&#x670D;&#x52A1;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x6837;&#x53C8;&#x6D89;&#x53CA;&#x5230;DTO&#x3001;WebService&#x3001;WCF&#x548C;WebApi&#xFF08;Rest&#xFF09;&#x7B49;&#x6982;&#x5FF5;&#x3002;&#x4F46;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;SOA&#x65B9;&#x5F0F;&#x4E0B;&#xFF0C;&#x5305;&#x62EC;&#x524D;&#x9762;&#x7684;MQ&#x65B9;&#x5F0F;&#x4E0B;&#xFF0C;&#x4E8B;&#x52A1;&#x4E00;&#x81F4;&#x6027;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x4FDD;&#x969C;&#x7684;&#xFF0C;&#x5FC5;&#x987B;&#x91C7;&#x7528;&#x4E00;&#x5B9A;&#x7684;&#x673A;&#x5236;&#x4F8B;&#x5982;&#x4E8B;&#x52A1;&#x8865;&#x507F;&#x673A;&#x5236;&#x6765;&#x786E;&#x4FDD;&#x4E8B;&#x52A1;&#x7684;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x5404;&#x4E2A;&#x4E1A;&#x52A1;&#x677F;&#x5757;&#x6240;&#x5728;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x65F6;&#x6BB5;&#x7684;&#x538B;&#x529B;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x4E3A;&#x4E86;&#x5C3D;&#x91CF;&#x505A;&#x5230;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x5185;&#x5404;&#x670D;&#x52A1;&#x5668;&#x7684;&#x538B;&#x529B;&#x5E73;&#x644A;&#xFF0C; &#x8FD8;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x66F4;&#x597D;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x8BB0;&#x5F55;&#x4E0B;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x538B;&#x529B;&#x3001;&#x8D44;&#x6E90;&#x60C5;&#x51B5;&#x3001;&#x8FDE;&#x63A5;&#x6570;&#x7B49;&#x7B49;&#xFF0C;&#x4EE5;&#x4FBF;&#x5C06;&#x65B0;&#x7684;&#x8BF7;&#x6C42;&#x8F6C;&#x5411;&#x5230;&#x538B;&#x529B;&#x6700;&#x5C0F;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;</p>
<p>&#x4E03;&#x3001;&#x4E1A;&#x52A1;&#x7EE7;&#x7EED;&#x53D1;&#x5C55;&#xFF0C;&#x5C31;&#x662F;CDN&#xFF0C;&#x518D;&#x5F80;&#x4E0B;&#x5C31;&#x662F;&#x642D;&#x5EFA;&#x51E0;&#x4E2A;&#x4E2D;&#x5FC3;&#xFF0C;&#x5C06;&#x7CFB;&#x7EDF;&#x90E8;&#x7F72;&#x5728;&#x5404;&#x4E2A;&#x4E2D;&#x5FC3;&#xFF0C;&#x5404;&#x5730;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x8DDD;&#x79BB;&#x4ED6;&#x6700;&#x8FD1;&#x7684;&#x4E2D;&#x5FC3;&#xFF0C;&#x4E2D;&#x5FC3;&#x95F4;&#x6570;&#x636E;&#x4FDD;&#x6301;&#x540C;&#x6B65;&#x3002;</p>
<p>&#x516B;&#x3001;&#x4E0A;&#x9762;&#x8BB2;&#x4E86;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x65B9;&#x9762;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x6570;&#x636E;&#x65B9;&#x9762;&#x4E5F;&#x8981;&#x505A;&#x8BB8;&#x591A;&#x5DE5;&#x4F5C;&#x3002;&#x4E0A;&#x9762;&#x5DF2;&#x7ECF;&#x4ECB;&#x7ECD;&#x4E86;&#x5206;&#x5E93;&#x5206;&#x8868;&#x65B9;&#x5F0F;&#x3002;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x505A;&#x5927;&#x4E86;&#xFF0C;&#x52BF;&#x5FC5;&#x6709;&#x8BB8;&#x591A;&#x7684;&#x6570;&#x636E;&#x8D44;&#x6E90;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x73B0;&#x5728;&#x5927;&#x6570;&#x636E;&#x8FD9;&#x4E2A;&#x540D;&#x8BCD;&#x975E;&#x5E38;&#x706B;&#x7206;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x5206;&#x6790;&#x548C;&#x5904;&#x7406;&#x662F;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x7684;&#x67E5;&#x8BE2;&#x3001;&#x5206;&#x6790;&#x7B49;&#x72EC;&#x7ACB;&#x51FA;&#x6765;&#xFF0C;&#x4E0D;&#x5F71;&#x54CD;&#x6B63;&#x5F0F;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x53E6;&#x5916;&#x662F;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x6316;&#x6398;&#x786E;&#x5B9E;&#x80FD;&#x5F97;&#x5230;&#x8BB8;&#x591A;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#xFF0C;&#x4E3B;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x642D;&#x5EFA;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x540E;&#x7EED;&#x7684;&#x5206;&#x6790;&#x548C;&#x5904;&#x7406;&#x3002;&#x4F7F;&#x7528;ETL/ELT&#x5C06;&#x6570;&#x636E;&#x5B9A;&#x671F;&#x4ECE;&#x6B63;&#x5F0F;&#x73AF;&#x5883;&#x4E2D;&#x5BFC;&#x5165;&#x5230;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x4E2D;&#xFF0C;&#x6309;&#x7167;&#x4E0D;&#x540C;&#x7684;&#x4E3B;&#x9898;&#x642D;&#x5EFA;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x6570;&#x636E;&#x96C6;&#x5E02;&#x3002;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x91CF;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;+&#x591A;&#x7EF4;&#x6570;&#x636E;&#x5E93;&#x7684;&#x65B9;&#x5F0F;&#xFF1B;&#x5BF9;&#x4E8E;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C31;&#x8981;&#x4F7F;&#x7528;&#x6309;&#x5217;&#x5B58;&#x50A8;&#x3001;&#x5E76;&#x884C;&#x6570;&#x636E;&#x5E93;&#x7B49;&#x65B9;&#x5F0F;&#x4E86;&#x3002;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x5206;&#x6790;&#x53EF;&#x4EE5;&#x4EE5;&#x62A5;&#x8868;&#x3001;KPI&#x3001;&#x4EEA;&#x8868;&#x76D8;&#x9A7E;&#x9A76;&#x8231;&#x7B49;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;&#x4E0A;&#x5C42;&#x9886;&#x5BFC;&#x51B3;&#x7B56;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6316;&#x6398;&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x548C;&#x8BAD;&#x7EC3;&#x7B49;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x4EF7;&#x503C;&#x53D1;&#x73B0;&#x3001;&#x98CE;&#x9669;&#x63A7;&#x5236;&#x7B49;&#x3002;</p>
<p>&#x4E5D;&#x3001;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F01;&#x4E1A;&#x662F;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x5927;&#x7684;&#x8D22;&#x529B;&#x548C;&#x4EBA;&#x5458;&#x53BB;&#x505A;&#x4E0A;&#x8FF0;&#x5185;&#x5BB9;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4F7F;&#x7528;&#x4E91;&#x6210;&#x4E3A;&#x4F01;&#x4E1A;&#x7684;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x3002;&#x65E0;&#x8BBA;&#x662F;Azure&#x3001;&#x963F;&#x91CC;&#x4E91;&#x3001;&#x4E9A;&#x9A6C;&#x900A;&#x7B49;&#x90FD;&#x4F1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x670D;&#x52A1;&#x3002;&#x6211;&#x4EEC;&#x5C31;&#x4EE5;&#x963F;&#x91CC;&#x4E91;&#x4E3A;&#x4F8B;&#xFF0C;ECS&#x63D0;&#x4F9B;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668;&#x3001;SLB&#x63D0;&#x4F9B;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3001;RDS&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x3001;OSS&#x63D0;&#x4F9B;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x3001;DRDS&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x670D;&#x52A1;&#x3001;ODSP&#xFF08;&#x73B0;&#x5728;&#x6539;&#x540D;&#x53EB;MaxCompute&#xFF09;&#x63D0;&#x4F9B;&#x5927;&#x6570;&#x636E;&#x7684;&#x8BA1;&#x7B97;&#x670D;&#x52A1;&#x3001;RocketMQ&#x63D0;&#x4F9B;MQ&#x3001;OCS&#x63D0;&#x4F9B;&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x3001;&#x4EE5;&#x53CA;CDN&#x3001;OTS&#x3001;ADS&#x7B49;&#x7B49;&#x5C31;&#x4E0D;&#x4E00;&#x4E00;&#x5217;&#x4E3E;&#x4E86;&#x3002;</p>
<p>&#x5BF9;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x8FD8;&#x6709;Docker&#x8FD9;&#x4E2A;&#x5229;&#x5668;&#xFF0C;&#x65E0;&#x8BBA;&#x5728;&#x4F01;&#x4E1A;&#x8FD8;&#x662F;&#x4E91;&#x4E2D;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x81EA;&#x5DF1;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x7684;Redis&#x3001;Memcached&#x3001;RabbitMQ&#x3001;Solr&#x7B49;&#x90FD;&#x90E8;&#x7F72;&#x5728;Docker&#x4E2D;&#xFF0C;&#x786E;&#x5B9E;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x8BF4;&#x4E86;&#x4E00;&#x5927;&#x5806;&#xFF0C;&#x5176;&#x5B9E;&#x67B6;&#x6784;&#x505A;&#x7684;&#x518D;&#x597D;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x5E95;&#x5C42;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x76EE;&#x524D;&#x6D41;&#x884C;&#x7684;&#x8BED;&#x8A00;&#x8FD8;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;OO&#x7684;Java&#x3001;.net&#x7B49;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8FD8;&#x662F;&#x7528;OO&#x7684;&#x601D;&#x60F3;&#x548C;&#x7406;&#x5FF5;&#x53BB;&#x7F16;&#x7A0B;&#x3002;&#x62BD;&#x8C61;&#x3001;&#x5C01;&#x88C5;&#x3001;&#x7EE7;&#x627F;&#x3001;&#x591A;&#x6001;&#x5C3D;&#x7BA1;&#x5F88;&#x5B57;&#x9762;&#x4E0A;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x4F46;&#x662F;&#x6DF1;&#x5165;&#x7684;&#x8BA4;&#x8BC6;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x4E00;&#x5B9A;&#x7684;&#x7A0B;&#x5E8F;&#x91CF;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x51E0;&#x5927;&#x539F;&#x5219;&#x548C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x8FD8;&#x662F;&#x7F16;&#x5199;&#x51FA;&#x66F4;&#x9AD8;&#x53EF;&#x6269;&#x5C55;&#x3001;&#x53EF;&#x66FF;&#x6362;&#x3001;&#x53EF;&#x914D;&#x7F6E;&#x3001;&#x53EF;&#x7EF4;&#x62A4;&#x7B49;&#x8F6F;&#x4EF6;&#x8D28;&#x91CF;&#x6307;&#x6807;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x91CD;&#x8981;&#x4FDD;&#x8BC1;&#x3002; </p>
<footer class="page-footer"><span class="copyright">&#xA9; Colin Chang all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2018-11-12 18:53:22
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="pages/mq.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 1 消息队列">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"分布式概述","level":"1.3","depth":1,"next":{"title":"1 消息队列","level":"1.4","depth":1,"path":"pages/mq.md","ref":"pages/mq.md","articles":[]},"previous":{"title":"Colin's Blog","level":"1.2","depth":1,"url":"http://colin-chang.site","ref":"http://colin-chang.site","articles":[]},"dir":"ltr"},"config":{"plugins":["disqus","-lunr","-search","search-plus","advanced-emoji","github","multipart","katex","splitter","tbfed-pagefooter","anchors","favicon","sitemap","copy-code-button","-sharing","toggle-chapters","book-summary-scroll-position-saver","prism","-highlight","livereload"],"styles":{"website":"website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"&copy Colin Chang","modify_label":"文件修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prismjs/themes/prism-okaidia.css"]},"disqus":{"useIdentifier":false,"shortName":"Idea"},"github":{"url":"https://github.com/colin-chang/distribution"},"livereload":{},"book-summary-scroll-position-saver":{},"splitter":{},"multipart":{},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"assets/images/favicon.ico","bookmark":"assets/images/favicon.ico","appleTouch":"assets/images/apple-touch-icon.png","appleTouchMore":{"120x120":"assets/images/apple-touch-icon-120x120.png","180x180":"assets/images/apple-touch-icon-180x180.png"}},"sitemap":{"hostname":"http://colin-chang.site/book/distribution"},"copy-code-button":{},"advanced-emoji":{"embedEmojis":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchors":{},"toggle-chapters":{},"search-plus":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"分布式-软件架构","gitbook":"*","description":"拥抱分布式架构"},"file":{"path":"README.md","mtime":"2018-11-12T10:53:22.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-08T11:49:36.045Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-toggle-chapters/toggle.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-book-summary-scroll-position-saver/book-summary-scroll-position-saver.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

